Revit 2027 API
Options Constructor
Creates a default Options object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Options()
Public Sub New
public:
Options()
new : unit -> Options
Remarks
Defaults to medium detail, no references and no view.
See Also
Reference
Options Class
Options Overload
Autodesk.Revit.DB Namespace